# data-database-types-relational-language-SQL-MySQL-function-stored-procedures-CREATE-PROCEDURE
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- **functions** - **procedures** - **store** **logic** that is **repeatedly** **used** - **avoids** - **repetition** - **inconsistencies** [1]

```sql
mysql> use lab5;
Database changed
```

```sql
mysql> show tables;
+----------------+
| Tables_in_lab5 |
+----------------+
| car            |
| person         |
+----------------+
2 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM CAR;
+--------------+--------+------------+--------+---------+------------+
| registration | make   | model      | colour | mileage | engineSize |
+--------------+--------+------------+--------+---------+------------+
| 05-MO-17931  | Toyota | Highlander | Green  |  253789 |        1.6 |
| 10-G-2334    | Toyota | Corolla    | Green  |  123389 |        1.3 |
| 10-WH-17931  | Toyota | Corolla    | Silver |  130389 |        1.4 |
| 11-MO-23431  | Toyota | Corolla    | Black  | 1234123 |        1.3 |
| 12-WH-123    | Ford   | Ka         | Black  |  125882 |        1.0 |
| 132-G-9923   | Ford   | Ka         | Silver |  325883 |        1.0 |
| 132-MO-19323 | Ford   | Galaxy     | Silver |    2343 |        1.5 |
| 171-G-39532  | Toyota | Corolla    | Silver |   55882 |        1.3 |
| 171-MO-12533 | Ford   | Fiesta     | Black  |   25882 |        1.0 |
| 99-G-300     | Toyota | Corolla    | Green  |  599339 |        1.3 |
+--------------+--------+------------+--------+---------+------------+
10 rows in set (0.00 sec)
```

- common query of the table - entity - relation - car - obtain details of certain make of car where the mileage is less than a certain value - query may be run many times with different rows - records - tuples - returned for make and mileage - good candidate to put into a procedure [1]

```sql
mysql> SELECT *
    -> FROM car
    -> WHERE make="Toyota"
    -> AND mileage<200000
    -> ORDER BY mileage;
+--------------+--------+---------+--------+---------+------------+
| registration | make   | model   | colour | mileage | engineSize |
+--------------+--------+---------+--------+---------+------------+
| 171-G-39532  | Toyota | Corolla | Silver |   55882 |        1.3 |
| 10-G-2334    | Toyota | Corolla | Green  |  123389 |        1.3 |
| 10-WH-17931  | Toyota | Corolla | Silver |  130389 |        1.4 |
+--------------+--------+---------+--------+---------+------------+
3 rows in set (0.00 sec)
```

- **procedure** - **created** **similar** to - **function** - **except** with **keyword** - **PROCEDURE** [1]

```sql
mysql> CREATE PROCEDURE MakeMileage(mk VARCHAR(20),ml INT(11))
    -> DETERMINISTIC
    -> BEGIN
    ->   SELECT *
    ->   FROM car
    ->   WHERE make LIKE mk
    ->   AND mileage < ml
    ->   ORDER BY mileage;
    -> END
    -> //
Query OK, 0 rows affected, 1 warning (0.01 sec)
```

- **call** - **procedure** - **keyword** - **CALL** - passing two argument for the two parameters - **instead** of **writing** a **potentially** **complex** **query** - just **call** **procedure** [1]

```sql
mysql> delimiter ;
mysql> CALL MakeMileage("Toyota",200000);
+--------------+--------+---------+--------+---------+------------+
| registration | make   | model   | colour | mileage | engineSize |
+--------------+--------+---------+--------+---------+------------+
| 171-G-39532  | Toyota | Corolla | Silver |   55882 |        1.3 |
| 10-G-2334    | Toyota | Corolla | Green  |  123389 |        1.3 |
| 10-WH-17931  | Toyota | Corolla | Silver |  130389 |        1.4 |
+--------------+--------+---------+--------+---------+------------+
3 rows in set (0.00 sec)

Query OK, 0 rows affected (0.01 sec)
```

```sql
mysql> CALL MakeMileage("Ford",5000);
+--------------+------+--------+--------+---------+------------+
| registration | make | model  | colour | mileage | engineSize |
+--------------+------+--------+--------+---------+------------+
| 132-MO-19323 | Ford | Galaxy | Silver |    2343 |        1.5 |
+--------------+------+--------+--------+---------+------------+
1 row in set (0.00 sec)

Query OK, 0 rows affected (0.00 sec)
```

- a **well** **designed** **procedure** can help **improve** its **use** - **obtain** **all** cars regardless of make with mileage less than sixty-thousand [1]

```sql
mysql> CALL MakeMileage("%",60000);
+--------------+--------+---------+--------+---------+------------+
| registration | make   | model   | colour | mileage | engineSize |
+--------------+--------+---------+--------+---------+------------+
| 132-MO-19323 | Ford   | Galaxy  | Silver |    2343 |        1.5 |
| 171-MO-12533 | Ford   | Fiesta  | Black  |   25882 |        1.0 |
| 171-G-39532  | Toyota | Corolla | Silver |   55882 |        1.3 |
+--------------+--------+---------+--------+---------+------------+
3 rows in set (0.00 sec)

Query OK, 0 rows affected (0.01 sec)
```

***
# END